OrderManagementGroup.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Order Management Load Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">Order Management Load Test - Virtual Vault E-commerce - Testing order operations with mixed user roles: Admins can manage order status, Members can only view orders in dashboard</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">http://localhost:6060</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ADMIN_EMAIL" elementType="Argument">
            <stringProp name="Argument.name">ADMIN_EMAIL</stringProp>
            <stringProp name="Argument.value">david123@gmail.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ADMIN_PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">ADMIN_PASSWORD</stringProp>
            <stringProp name="Argument.value">12345678</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="MEMBER_EMAIL" elementType="Argument">
            <stringProp name="Argument.name">MEMBER_EMAIL</stringProp>
            <stringProp name="Argument.value">loadtest1@test.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="MEMBER_PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">MEMBER_PASSWORD</stringProp>
            <stringProp name="Argument.value">password123</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">6060</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">User-Agent</stringProp>
            <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      
      <!-- Order Management Test Group -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Mixed Admin and Member Order Operations" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        
        <!-- Role Assignment: Mixed Admin and Member Users -->
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="01 - User Role Assignment" enabled="true">
          <stringProp name="BeanShellSampler.query"><![CDATA[// Assign user roles: 30% Admin (can manage orders), 70% Members (view only)
int threadNum = ctx.getThreadNum() + 1;

// Determine user role based on thread number
boolean isAdmin = (threadNum <= 6); // First 6 threads are admins (30% of 20)
boolean isMember = !isAdmin;

if (isAdmin) {
    // Admin user setup
    vars.put("is_admin", "true");
    vars.put("is_member", "false");
    vars.put("user_email", "${ADMIN_EMAIL}");
    vars.put("user_password", "${ADMIN_PASSWORD}");
    vars.put("user_role", "admin");
    vars.put("user_name", "Admin User " + threadNum);
    vars.put("can_manage_orders", "true");
    
    log.info("Thread " + threadNum + " assigned ADMIN role: " + vars.get("user_email"));
} else {
    // Member user setup  
    vars.put("is_admin", "false");
    vars.put("is_member", "true");
    vars.put("user_email", "${MEMBER_EMAIL}");
    vars.put("user_password", "${MEMBER_PASSWORD}");
    vars.put("user_role", "member");
    vars.put("user_name", "Member User " + threadNum);
    vars.put("can_manage_orders", "false");
    
    log.info("Thread " + threadNum + " assigned MEMBER role: " + vars.get("user_email"));
}

SampleResult.setResponseData("User Role Assignment Complete" + System.lineSeparator() + 
                           "Thread: " + threadNum + System.lineSeparator() + 
                           "Role: " + vars.get("user_role").toUpperCase() + System.lineSeparator() +
                           "Email: " + vars.get("user_email") + System.lineSeparator() +
                           "Name: " + vars.get("user_name") + System.lineSeparator() +
                           "Can Manage Orders: " + vars.get("can_manage_orders"));
SampleResult.setDataType(SampleResult.TEXT);
SampleResult.setSuccessful(true);
]]></stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        
        <!-- User Login (Admin or Member) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 - User Login" enabled="true">
          <stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "email": "${user_email}",
  "password": "${user_password}"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract User Token and Info" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">user_token;user_id;logged_user_name</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.token;$.user._id;$.user.name</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">TOKEN_NOT_FOUND;USER_ID_NOT_FOUND;USER_NAME_NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Login Success" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">User login must be successful</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="Store User Credentials" enabled="true">
            <stringProp name="BeanShellPostProcessor.query"><![CDATA[// Store user credentials and role information
String userToken = vars.get("user_token");
String userId = vars.get("user_id");
String loggedUserName = vars.get("logged_user_name");
String userRole = vars.get("user_role");
int threadNum = ctx.getThreadNum() + 1;

log.info("✅ " + userRole.toUpperCase() + " LOGIN SUCCESS - Thread " + threadNum);
log.info("   User Name: " + loggedUserName);
log.info("   User ID: " + userId);
log.info("   Email: " + vars.get("user_email"));
log.info("   Token Length: " + (userToken != null ? userToken.length() : 0));
]]></stringProp>
            <boolProp name="BeanShellPostProcessor.resetInterpreter">false</boolProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>
        
        <!-- Admin: Get All Orders -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="03A - Admin: Get All Orders" enabled="true">
          <stringProp name="IfController.condition">"${is_admin}".equals("true")</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="04 - Admin Get All Orders" enabled="true">
            <stringProp name="HTTPSampler.path">/api/v1/auth/all-orders</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Admin Authorization Header" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${user_token}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Admin Get Orders Success" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Admin must be able to get all orders</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
            <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="Process Admin Orders" enabled="true">
              <stringProp name="BeanShellPostProcessor.query"><![CDATA[// Process admin orders response and prepare for management
String response = prev.getResponseDataAsString();
String responseCode = prev.getResponseCode();
int threadNum = ctx.getThreadNum() + 1;

log.info("🔧 ADMIN ORDER MANAGEMENT - Thread: " + threadNum);
log.info("   Response Code: " + responseCode);
log.info("   Response Length: " + (response != null ? response.length() : 0));

// Initialize order management variables
int totalOrders = 0;
int ordersToManage = 2; // Set a fixed number for testing

if ("200".equals(responseCode) && response != null && response.length() > 20) {
    try {
        // Estimate orders for admin management
        if (response.contains("orders") || response.contains("_id")) {
            int idCount = response.split("_id").length - 1;
            totalOrders = Math.max(1, idCount);
            ordersToManage = Math.min(totalOrders, 2 + (int)(Math.random() * 3));
            
            log.info("   Total Orders in System: " + totalOrders);
            log.info("   Orders Selected for Status Management: " + ordersToManage);
        } else {
            totalOrders = 5; // Assume some orders exist
        }
    } catch (Exception e) {
        log.error("Error processing admin orders: " + e.getMessage());
        totalOrders = 5;
        ordersToManage = 2;
    }
} else {
    log.warn("   No orders response for admin processing");
    totalOrders = 5;
    ordersToManage = 2;
}

// Store admin order management data
vars.put("total_orders_count", String.valueOf(totalOrders));
vars.put("orders_to_manage_count", String.valueOf(ordersToManage));

log.info("   Orders Available for Management: " + ordersToManage);
]]></stringProp>
              <boolProp name="BeanShellPostProcessor.resetInterpreter">false</boolProp>
            </BeanShellPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        
        <!-- Admin-Only: Order Status Management -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="03B - Admin: Order Status Management" enabled="true">
          <stringProp name="IfController.condition">"${is_admin}".equals("true")</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <!-- Loop through order status updates -->
          <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Process Order Status Updates" enabled="true">
            <boolProp name="LoopController.continue_forever">false</boolProp>
            <stringProp name="LoopController.loops">${orders_to_manage_count}</stringProp>
          </LoopController>
          <hashTree>
            <!-- Prepare Order Status Update -->
            <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Prepare Order Status Update" enabled="true">
              <stringProp name="BeanShellSampler.query"><![CDATA[// Prepare order status update
int loopIndex = Integer.parseInt(vars.get("__jm__Process Order Status Updates__idx"));
int threadNum = ctx.getThreadNum() + 1;

// Create realistic order ID for testing
String orderId = "ORDER-ADMIN-T" + threadNum + "-" + loopIndex + "-" + System.currentTimeMillis();
String currentStatus = "Not Process";
String newStatus = "Processing";

// For variety, change status progression based on loop index
String[] statusProgression = {"Not Process", "Processing", "Shipped", "deliverd"};
if (loopIndex < statusProgression.length - 1) {
    currentStatus = statusProgression[loopIndex];
    newStatus = statusProgression[loopIndex + 1];
}

// Store current update info
vars.put("current_order_id", orderId);
vars.put("current_order_status", currentStatus);
vars.put("new_order_status", newStatus);

log.info("🔄 ADMIN STATUS UPDATE " + (loopIndex + 1) + " - Thread " + threadNum);
log.info("   Order ID: " + orderId);
log.info("   Status Change: " + currentStatus + " → " + newStatus);

SampleResult.setResponseData("Order Status Update Prepared" + System.lineSeparator() + 
                           "Order ID: " + orderId + System.lineSeparator() +
                           "Current Status: " + currentStatus + System.lineSeparator() +
                           "New Status: " + newStatus + System.lineSeparator() +
                           "Admin Thread: " + threadNum + System.lineSeparator() +
                           "Update #: " + (loopIndex + 1));
SampleResult.setDataType(SampleResult.TEXT);
SampleResult.setSuccessful(true);
]]></stringProp>
              <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
            </BeanShellSampler>
            <hashTree/>
            
            <!-- Update Order Status API Call -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Admin Update Order Status" enabled="true">
              <stringProp name="HTTPSampler.path">/api/v1/auth/order-status/${current_order_id}</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <stringProp name="HTTPSampler.method">PUT</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{
  "status": "${new_order_status}"
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
            </HTTPSamplerProxy>
            <hashTree>
              <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Order Status Update Authorization" enabled="true">
                <collectionProp name="HeaderManager.headers">
                  <elementProp name="" elementType="Header">
                    <stringProp name="Header.name">Authorization</stringProp>
                    <stringProp name="Header.value">Bearer ${user_token}</stringProp>
                  </elementProp>
                </collectionProp>
              </HeaderManager>
              <hashTree/>
              <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Order Status Update Success" enabled="true">
                <collectionProp name="Asserion.test_strings">
                  <stringProp name="49586">200</stringProp>
                </collectionProp>
                <stringProp name="Assertion.custom_message">Order status must be updated successfully</stringProp>
                <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                <boolProp name="Assertion.assume_success">false</boolProp>
                <intProp name="Assertion.test_type">8</intProp>
              </ResponseAssertion>
              <hashTree/>
              <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="Log Status Update Result" enabled="true">
                <stringProp name="BeanShellPostProcessor.query"><![CDATA[// Log the status update result
String orderId = vars.get("current_order_id");
String oldStatus = vars.get("current_order_status");
String newStatus = vars.get("new_order_status");
String responseCode = prev.getResponseCode();
String responseMessage = prev.getResponseMessage();
int threadNum = ctx.getThreadNum() + 1;

if ("200".equals(responseCode)) {
    log.info("✅ STATUS UPDATE SUCCESS: Admin Thread " + threadNum);
    log.info("   Order ID: " + orderId);
    log.info("   Status: " + oldStatus + " → " + newStatus);
} else {
    log.error("❌ STATUS UPDATE FAILED: Admin Thread " + threadNum);
    log.error("   Order ID: " + orderId);
    log.error("   Response Code: " + responseCode);
    log.error("   Response Message: " + responseMessage);
}
]]></stringProp>
                <boolProp name="BeanShellPostProcessor.resetInterpreter">false</boolProp>
              </BeanShellPostProcessor>
              <hashTree/>
            </hashTree>
            
            <!-- Think Time Between Status Updates -->
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time Between Updates" enabled="true">
              <stringProp name="ConstantTimer.delay">200</stringProp>
              <stringProp name="RandomTimer.range">500</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          
          <!-- Admin Order Management Summary -->
          <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="06 - Admin Order Management Summary" enabled="true">
            <stringProp name="BeanShellSampler.query"><![CDATA[// Generate admin order management summary
String totalOrders = vars.get("total_orders_count");
String ordersUpdated = vars.get("orders_to_manage_count");
String adminName = vars.get("logged_user_name");
String adminEmail = vars.get("user_email");
int threadNum = ctx.getThreadNum() + 1;

log.info("📊 ADMIN MANAGEMENT SUMMARY - Thread " + threadNum);
log.info("   Admin: " + adminName + " (" + adminEmail + ")");
log.info("   Total Orders in System: " + totalOrders);
log.info("   Order Status Updates Processed: " + ordersUpdated);

SampleResult.setResponseData("Admin Order Management Complete!" + System.lineSeparator() + 
                           "Thread: " + threadNum + System.lineSeparator() +
                           "Admin: " + adminName + " (" + adminEmail + ")" + System.lineSeparator() +
                           "Total Orders in System: " + totalOrders + System.lineSeparator() +
                           "Status Updates Processed: " + ordersUpdated + System.lineSeparator() +
                           "Management Session: Successful");
SampleResult.setDataType(SampleResult.TEXT);
SampleResult.setSuccessful(true);
]]></stringProp>
            <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
          </BeanShellSampler>
          <hashTree/>
        </hashTree>
        
        <!-- Member: Get Own Orders (Dashboard View) -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Member: Get Own Orders" enabled="true">
          <stringProp name="IfController.condition">"${is_member}".equals("true")</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="05 - Member Get Own Orders" enabled="true">
            <stringProp name="HTTPSampler.path">/api/v1/auth/orders</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Member Authorization Header" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${user_token}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Member Get Orders Success" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Member must be able to view own orders</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
            <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="Process Member Orders" enabled="true">
              <stringProp name="BeanShellPostProcessor.query"><![CDATA[// Process member orders response (view only)
String response = prev.getResponseDataAsString();
String responseCode = prev.getResponseCode();
int threadNum = ctx.getThreadNum() + 1;

log.info("👀 MEMBER ORDER DASHBOARD - Thread: " + threadNum);
log.info("   Response Code: " + responseCode);
log.info("   Response Length: " + (response != null ? response.length() : 0));

// Initialize member order viewing variables
int memberOrders = 0;

if ("200".equals(responseCode) && response != null && response.length() > 20) {
    try {
        // Count member's own orders
        if (response.contains("orders") || response.contains("_id")) {
            int idCount = response.split("_id").length - 1;
            memberOrders = Math.max(0, idCount);
            
            log.info("   Member's Orders Found: " + memberOrders);
        }
    } catch (Exception e) {
        log.error("Error processing member orders: " + e.getMessage());
        memberOrders = 0;
    }
} else {
    log.warn("   No orders found for member or invalid response");
    memberOrders = 0;
}

// Store member order viewing data
vars.put("member_orders_count", String.valueOf(memberOrders));

log.info("   Dashboard View: " + memberOrders + " orders displayed");
]]></stringProp>
              <boolProp name="BeanShellPostProcessor.resetInterpreter">false</boolProp>
            </BeanShellPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        
        <!-- Summary Report -->
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="03 - Order Load Test Report" enabled="true">
          <stringProp name="BeanShellSampler.query"><![CDATA[// Generate comprehensive final report
int threadNum = ctx.getThreadNum() + 1;
String userRole = vars.get("user_role");
String userEmail = vars.get("user_email");
String userName = vars.get("user_name");

// Create comprehensive report
String report = "=== ORDER MANAGEMENT LOAD TEST COMPLETE ===" + System.lineSeparator() + System.lineSeparator() +
               "Thread " + threadNum + " Summary:" + System.lineSeparator() +
               "Role: " + userRole.toUpperCase() + System.lineSeparator() +
               "User: " + userName + " (" + userEmail + ")" + System.lineSeparator();

// Add role-specific summary
if ("admin".equals(userRole)) {
    String ordersManaged = vars.get("orders_to_manage_count");
    String totalOrdersManaged = vars.get("total_orders_count");
    if (ordersManaged == null) ordersManaged = "0";
    if (totalOrdersManaged == null) totalOrdersManaged = "0";
    
    report += System.lineSeparator() + "Admin Activities Completed:" + System.lineSeparator() +
             "✅ Logged in as admin: " + userName + System.lineSeparator() +
             "✅ Retrieved all orders (" + totalOrdersManaged + " orders)" + System.lineSeparator() +
             "✅ Successfully processed " + ordersManaged + " order status updates" + System.lineSeparator() +
             "✅ Managed complete order workflow (Not Process → Processing → Shipped → Delivered)" + System.lineSeparator() +
             "✅ Verified admin order management capabilities" + System.lineSeparator();
             
} else if ("member".equals(userRole)) {
    String memberOrderCount = vars.get("member_orders_count");
    if (memberOrderCount == null) memberOrderCount = "0";
    
    report += System.lineSeparator() + "Member Activities Completed:" + System.lineSeparator() +
             "✅ Logged in as member: " + userName + System.lineSeparator() +
             "✅ Viewed personal dashboard" + System.lineSeparator() +
             "✅ Checked own orders (" + memberOrderCount + " orders)" + System.lineSeparator() +
             "✅ Verified view-only access (no status change permissions)" + System.lineSeparator() +
             "✅ Confirmed dashboard functionality" + System.lineSeparator();
}

report += System.lineSeparator() + "🎉 Order Management Load Testing Complete!";

SampleResult.setResponseData(report);
SampleResult.setDataType(SampleResult.TEXT);
SampleResult.setSuccessful(true);

log.info("=== ORDER LOAD TEST COMPLETE ===");
log.info("Thread " + threadNum + " (" + userRole.toUpperCase() + ") finished successfully");
]]></stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        
      </hashTree>
      
      <!-- Results Tree Listener for debugging -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>